IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
#include "wless_sm.h"

#if WLESS_SM_TICK_GPIO_TEST_ENABLE == 1
#include "driverlib.h"
#endif

#if WLESS_SM_POWER_CONTROL_ENABLE == 1
#include "clllc.h"
#include "ttplpfc.h"
#endif

#pragma RETAIN(WLESS_SM_state)
#pragma RETAIN(WLESS_SM_localRole)
#pragma RETAIN(WLESS_SM_remoteRole)
#pragma RETAIN(WLESS_SM_localCtrlState)
#pragma RETAIN(WLESS_SM_remoteCtrlState)
#pragma RETAIN(WLESS_SM_localAbort)
#pragma RETAIN(WLESS_SM_remoteAbort)
#pragma RETAIN(WLESS_SM_radioLink)
#pragma RETAIN(WLESS_SM_opMode)
#pragma RETAIN(WLESS_SM_wptState)
#pragma RETAIN(WLESS_SM_powerCommand)
#pragma RETAIN(WLESS_SM_localEnergyEncoded)
#pragma RETAIN(WLESS_SM_remoteEnergyEncoded)
#pragma RETAIN(WLESS_SM_vBus_V)
#pragma RETAIN(WLESS_SM_iBat_mA)
#pragma RETAIN(WLESS_SM_iCoil_mA)
#pragma RETAIN(WLESS_SM_powerToLoad)
#pragma RETAIN(WLESS_SM_iCoilErr)
#pragma RETAIN(WLESS_SM_noAckCount)
#pragma RETAIN(WLESS_SM_initOkCommand)
#pragma RETAIN(WLESS_SM_stopCommand)
#pragma RETAIN(WLESS_SM_diagnosticMessagePending)
#pragma RETAIN(WLESS_SM_operationMessagePending)
#pragma RETAIN(WLESS_SM_statusUpdatePending)
#pragma RETAIN(WLESS_SM_pendingTicks)
#pragma RETAIN(WLESS_SM_pendingTicksMax)
#pragma RETAIN(WLESS_SM_ticksDropped)
#pragma RETAIN(WLESS_SM_sourceTickAccumulator)
#pragma RETAIN(WLESS_SM_tickCounter)
#pragma RETAIN(WLESS_SM_stateStepCounter)

volatile WLESS_SM_State WLESS_SM_state;
volatile WLESS_SM_Role WLESS_SM_localRole;
volatile WLESS_SM_Role WLESS_SM_remoteRole;
volatile WLESS_SM_ControllerState WLESS_SM_localCtrlState;
volatile WLESS_SM_ControllerState WLESS_SM_remoteCtrlState;
volatile WLESS_SM_Abort WLESS_SM_localAbort;
volatile WLESS_SM_Abort WLESS_SM_remoteAbort;
volatile WLESS_SM_RadioLink WLESS_SM_radioLink;
volatile WLESS_SM_OpMode WLESS_SM_opMode;
volatile WLESS_SM_WptState WLESS_SM_wptState;
volatile WLESS_SM_PowerCommand WLESS_SM_powerCommand;

volatile int16_t WLESS_SM_localEnergyEncoded;
volatile int16_t WLESS_SM_remoteEnergyEncoded;
volatile uint16_t WLESS_SM_vBus_V;
volatile uint16_t WLESS_SM_iBat_mA;
volatile uint16_t WLESS_SM_iCoil_mA;
volatile uint16_t WLESS_SM_vBusMin_V = WLESS_SM_VBUS_MIN_V;
volatile uint16_t WLESS_SM_iBatMin_mA = WLESS_SM_IBAT_MIN_MA;
volatile uint16_t WLESS_SM_iCoilMin_mA = WLESS_SM_ICOIL_MIN_MA;
volatile int16_t WLESS_SM_powerToLoad;
volatile int16_t WLESS_SM_iCoilErr;
volatile uint16_t WLESS_SM_noAckCount;

volatile uint16_t WLESS_SM_initOkCommand;
volatile uint16_t WLESS_SM_stopCommand;
volatile uint16_t WLESS_SM_diagnosticMessagePending;
volatile uint16_t WLESS_SM_operationMessagePending;
volatile uint16_t WLESS_SM_statusUpdatePending;
volatile uint16_t WLESS_SM_pendingTicks;
volatile uint16_t WLESS_SM_pendingTicksMax;
volatile uint16_t WLESS_SM_ticksDropped;
volatile uint32_t WLESS_SM_sourceTickAccumulator;
volatile uint32_t WLESS_SM_tickCounter;
volatile uint32_t WLESS_SM_stateStepCounter;

typedef struct
{
    uint16_t count;
    uint32_t lastStep;
    bool latched;
} WLESS_SM_ConditionFilter;

static WLESS_SM_ConditionFilter WLESS_SM_sourceEmptyFilter;
static WLESS_SM_ConditionFilter WLESS_SM_loadFullFilter;
static WLESS_SM_ConditionFilter WLESS_SM_energyBalanceFilter;
static WLESS_SM_ConditionFilter WLESS_SM_vBusFilter;
static WLESS_SM_ConditionFilter WLESS_SM_iBatFilter;
static WLESS_SM_ConditionFilter WLESS_SM_iCoilFilter;
static WLESS_SM_State WLESS_SM_filterState;
static WLESS_SM_Role WLESS_SM_filterRole;

static void WLESS_SM_resetFilter(WLESS_SM_ConditionFilter *filter)
{
    filter->count = 0U;
    filter->lastStep = 0UL;
    filter->latched = false;
}

static bool WLESS_SM_updateFilteredCondition(WLESS_SM_ConditionFilter *filter,
                                             bool tripCondition,
                                             bool releaseCondition,
                                             bool latchResult)
{
    if(filter->latched)
    {
        if(releaseCondition)
        {
            WLESS_SM_resetFilter(filter);
        }
        return filter->latched;
    }

    if(!tripCondition)
    {
        filter->count = 0U;
        return false;
    }

    if(filter->lastStep != WLESS_SM_stateStepCounter)
    {
        filter->lastStep = WLESS_SM_stateStepCounter;
        if(filter->count < WLESS_SM_ANALOG_CONFIRM_SAMPLES)
        {
            filter->count++;
        }
    }

    if(filter->count >= WLESS_SM_ANALOG_CONFIRM_SAMPLES)
    {
        filter->count = 0U;
        if(latchResult)
        {
            filter->latched = true;
        }
        return true;
    }

    return false;
}

static bool WLESS_SM_confirmVBusReady(void)
{
    return WLESS_SM_updateFilteredCondition(&WLESS_SM_vBusFilter,
            WLESS_SM_vBus_V > WLESS_SM_vBusMin_V, false, false);
}

static bool WLESS_SM_confirmIBatLow(void)
{
    return WLESS_SM_updateFilteredCondition(&WLESS_SM_iBatFilter,
            WLESS_SM_iBat_mA < WLESS_SM_iBatMin_mA, false, false);
}

static bool WLESS_SM_confirmICoilLow(void)
{
    return WLESS_SM_updateFilteredCondition(&WLESS_SM_iCoilFilter,
            WLESS_SM_iCoil_mA < WLESS_SM_iCoilMin_mA, false, false);
}

static bool WLESS_SM_radioLinkKo(void)
{
    if(WLESS_SM_noAckCount >= 15U)
    {
        WLESS_SM_radioLink = WLESS_SM_LINK_FAIL;
        return true;
    }

    WLESS_SM_radioLink = WLESS_SM_LINK_OK;
    return false;
}

int16_t WLESS_SM_encodeCapacityWh(int32_t capacityWh)
{
    const int32_t den = WLESS_SM_CAPACITY_MAX_WH - WLESS_SM_CAPACITY_THRESHOLD_WH;
    int64_t num = (int64_t)(capacityWh - WLESS_SM_CAPACITY_THRESHOLD_WH) * 32767L;
    int32_t encoded;

    if(num >= 0)
    {
        num += den / 2;
    }
    else
    {
        num -= den / 2;
    }

    encoded = (int32_t)(num / den);

    if(encoded > 32767L)
    {
        encoded = 32767L;
    }
    if(encoded < -32768L)
    {
        encoded = -32768L;
    }

    return (int16_t)encoded;
}

int32_t WLESS_SM_decodeCapacityWh(int16_t encodedCapacity)
{
    int64_t num;
    int32_t decoded;

    if(encodedCapacity >= 32767)
    {
        return WLESS_SM_CAPACITY_MAX_WH;
    }
    if(encodedCapacity <= -32768)
    {
        return WLESS_SM_CAPACITY_MIN_WH;
    }

    num = (int64_t)encodedCapacity *
          (WLESS_SM_CAPACITY_MAX_WH - WLESS_SM_CAPACITY_THRESHOLD_WH);

