IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
    if(num >= 0)
    {
        num += 32767L / 2L;
    }
    else
    {
        num -= 32767L / 2L;
    }

    decoded = (int32_t)(num / 32767L) + WLESS_SM_CAPACITY_THRESHOLD_WH;
    return decoded;
}

static bool WLESS_SM_externalStopCommand(void)
{
    if(WLESS_SM_stopCommand != 0U)
    {
        WLESS_SM_stopCommand = 0U;
        return true;
    }

    return false;
}

static bool WLESS_SM_sourceIsEmpty(void)
{
    int32_t sourceEnergy;

    sourceEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded);

    return WLESS_SM_updateFilteredCondition(&WLESS_SM_sourceEmptyFilter,
            sourceEnergy <= WLESS_SM_CAPACITY_MIN_WH,
            sourceEnergy >= (WLESS_SM_CAPACITY_MIN_WH +
                             WLESS_SM_ENERGY_HYSTERESIS_WH),
            true);
}

static bool WLESS_SM_loadIsFull(void)
{
    int32_t loadEnergy;

    loadEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded);

    return WLESS_SM_updateFilteredCondition(&WLESS_SM_loadFullFilter,
            loadEnergy >= WLESS_SM_CAPACITY_MAX_WH,
            loadEnergy <= (WLESS_SM_CAPACITY_MAX_WH -
                           WLESS_SM_ENERGY_HYSTERESIS_WH),
            true);
}

static WLESS_SM_WptState WLESS_SM_runWptDecision(void)
{
#if WLESS_SM_BUILD_VEHICLE == 1
    int32_t loadEnergy;
    int32_t sourceEnergy;

    loadEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded);

    sourceEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded);

    if(WLESS_SM_externalStopCommand() ||
       WLESS_SM_sourceIsEmpty() ||
       WLESS_SM_loadIsFull() ||
       WLESS_SM_updateFilteredCondition(&WLESS_SM_energyBalanceFilter,
          (loadEnergy > WLESS_SM_CAPACITY_THRESHOLD_WH) &&
          (sourceEnergy <= WLESS_SM_CAPACITY_THRESHOLD_WH),
          (loadEnergy <= (WLESS_SM_CAPACITY_THRESHOLD_WH -
                          WLESS_SM_ENERGY_HYSTERESIS_WH)) ||
          (sourceEnergy > (WLESS_SM_CAPACITY_THRESHOLD_WH +
                           WLESS_SM_ENERGY_HYSTERESIS_WH)),
          true))
    {
        WLESS_SM_wptState = WLESS_SM_WPT_STOP;
        return WLESS_SM_WPT_STOP;
    }
#else
    if(WLESS_SM_externalStopCommand())
    {
        WLESS_SM_wptState = WLESS_SM_WPT_STOP;
        return WLESS_SM_WPT_STOP;
    }
#endif

    WLESS_SM_wptState = WLESS_SM_WPT_RUN;
    return WLESS_SM_WPT_RUN;
}

static void WLESS_SM_setPowerCommand(WLESS_SM_PowerCommand command)
{
    WLESS_SM_powerCommand = command;

#if WLESS_SM_POWER_CONTROL_ENABLE == 1
    if(command == WLESS_SM_POWER_CMD_OFF)
    {
        TTPLPFC_bbcDockTestEnable = 0;
        TTPLPFC_bbcEnabled = 0;
        CLLLC_hfcReceiverTestRun = 0U;
        CLLLC_hfcReceiverTestEnable = 0U;
    }
    else if((command == WLESS_SM_POWER_CMD_SOURCE_PRECHARGE) ||
            (command == WLESS_SM_POWER_CMD_SOURCE_ON))
    {
        TTPLPFC_bbcDockTestMode = TTPLPFC_BBC_MODE_BOOST;
        TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_BOTH;
        TTPLPFC_bbcDockTestEnable = 1;
        CLLLC_clearTrip = 1;
    }
    else if((command == WLESS_SM_POWER_CMD_LOAD_PRECHARGE) ||
            (command == WLESS_SM_POWER_CMD_LOAD_ON))
    {
        TTPLPFC_bbcDockTestMode = TTPLPFC_BBC_MODE_BUCK;
        TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_BOTH;
        TTPLPFC_bbcDockTestEnable = 1;
        CLLLC_hfcReceiverTestRun = 0U;
        CLLLC_hfcReceiverTestEnable = 0U;
    }
#endif
}

#if WLESS_SM_BUILD_VEHICLE == 0
static void WLESS_SM_resetLocalExchange(void)
{
    WLESS_SM_powerToLoad = 0;
    WLESS_SM_iCoilErr = 0;
    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
}
#endif

void WLESS_SM_init(void)
{
#if WLESS_SM_TICK_GPIO_TEST_ENABLE == 1
    GPIO_setPinConfig(GPIO_30_GPIO30);
    GPIO_setControllerCore(WLESS_SM_TICK_GPIO_PIN, GPIO_CORE_CPU1);
    GPIO_setPadConfig(WLESS_SM_TICK_GPIO_PIN, GPIO_PIN_TYPE_STD);
    GPIO_setDirectionMode(WLESS_SM_TICK_GPIO_PIN, GPIO_DIR_MODE_OUT);
    GPIO_writePin(WLESS_SM_TICK_GPIO_PIN, 0U);
#endif

    WLESS_SM_state = WLESS_SM_STATE_STANDBY;
    WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
    WLESS_SM_remoteRole = WLESS_SM_ROLE_NONE;
    WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
    WLESS_SM_remoteCtrlState = WLESS_SM_CTRL_IDLE;
    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
    WLESS_SM_remoteAbort = WLESS_SM_ABORT_DISABLED;
    WLESS_SM_radioLink = WLESS_SM_LINK_OK;
    WLESS_SM_opMode = WLESS_SM_MODE_AUTO;
    WLESS_SM_wptState = WLESS_SM_WPT_STOP;
    WLESS_SM_powerCommand = WLESS_SM_POWER_CMD_OFF;
    WLESS_SM_localEnergyEncoded = 0;
    WLESS_SM_remoteEnergyEncoded = 0;
    WLESS_SM_vBus_V = 0U;
    WLESS_SM_iBat_mA = 0U;
    WLESS_SM_iCoil_mA = 0U;
    WLESS_SM_powerToLoad = 0;
    WLESS_SM_iCoilErr = 0;
    WLESS_SM_noAckCount = 0U;
    WLESS_SM_initOkCommand = 0U;
    WLESS_SM_stopCommand = 0U;
    WLESS_SM_diagnosticMessagePending = 0U;
    WLESS_SM_operationMessagePending = 0U;
    WLESS_SM_statusUpdatePending = 1U;
    WLESS_SM_pendingTicks = 0U;
    WLESS_SM_pendingTicksMax = 0U;
    WLESS_SM_ticksDropped = 0U;
    WLESS_SM_sourceTickAccumulator = 0UL;
    WLESS_SM_tickCounter = 0UL;
    WLESS_SM_stateStepCounter = 0UL;
    WLESS_SM_resetFilter(&WLESS_SM_sourceEmptyFilter);
    WLESS_SM_resetFilter(&WLESS_SM_loadFullFilter);
    WLESS_SM_resetFilter(&WLESS_SM_energyBalanceFilter);
    WLESS_SM_resetFilter(&WLESS_SM_vBusFilter);
    WLESS_SM_resetFilter(&WLESS_SM_iBatFilter);
    WLESS_SM_resetFilter(&WLESS_SM_iCoilFilter);
    WLESS_SM_filterState = WLESS_SM_state;
    WLESS_SM_filterRole = WLESS_SM_localRole;
}

void WLESS_SM_onSourceTickIsr(void)
{
    WLESS_SM_sourceTickAccumulator += WLESS_SM_BASE_TICK_HZ;

    if(WLESS_SM_sourceTickAccumulator >= WLESS_SM_SOURCE_TICK_HZ)
    {
        WLESS_SM_sourceTickAccumulator -= WLESS_SM_SOURCE_TICK_HZ;

#if WLESS_SM_TICK_GPIO_TEST_ENABLE == 1
        GPIO_togglePin(WLESS_SM_TICK_GPIO_PIN);
#endif

        if(WLESS_SM_pendingTicks < WLESS_SM_PENDING_TICK_LIMIT)
        {
            WLESS_SM_pendingTicks++;

