IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
            if(WLESS_SM_pendingTicks > WLESS_SM_pendingTicksMax)
            {
                WLESS_SM_pendingTicksMax = WLESS_SM_pendingTicks;
            }
        }
        else
        {
            WLESS_SM_ticksDropped++;
        }
    }
}

void WLESS_SM_servicePendingTicks(void)
{
    while(WLESS_SM_pendingTicks != 0U)
    {
        WLESS_SM_pendingTicks--;
        WLESS_SM_runBackgroundTick();
    }
}

void WLESS_SM_runBackgroundTick(void)
{
#if WLESS_SM_BUILD_VEHICLE == 1
    bool operationStateActive;
#endif

    WLESS_SM_tickCounter++;

#if WLESS_SM_BUILD_VEHICLE == 1
    operationStateActive =
            (WLESS_SM_state == WLESS_SM_STATE_SOURCE_ON) ||
            (WLESS_SM_state == WLESS_SM_STATE_LOAD_ON) ||
            (WLESS_SM_state == WLESS_SM_STATE_PRECHARGE_LOAD) ||
            (WLESS_SM_state == WLESS_SM_STATE_DISCHARGE_SOURCE);

    if(operationStateActive &&
       ((WLESS_SM_tickCounter % WLESS_SM_OPERATION_TICKS) == 0UL))
    {
        WLESS_SM_operationMessagePending = 1U;
    }
#endif

    if((WLESS_SM_tickCounter % WLESS_SM_DIAGNOSTIC_TICKS) == 0UL)
    {
        WLESS_SM_diagnosticMessagePending = 1U;

#if WLESS_SM_BUILD_VEHICLE == 1
        if(!operationStateActive)
        {
            WLESS_SM_operationMessagePending = 1U;
        }
#else
        if(WLESS_SM_noAckCount < 15U)
        {
            WLESS_SM_noAckCount++;
        }
#endif
    }
}

#if WLESS_SM_BUILD_VEHICLE == 1
static void WLESS_SM_runVehicleStandbyOnly(void)
{
    if(WLESS_SM_radioLinkKo())
    {
        WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
        WLESS_SM_powerToLoad = 0;
        WLESS_SM_iCoilErr = 0;
        WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
        WLESS_SM_state = WLESS_SM_STATE_DISCOVERY;
    }
    else if(WLESS_SM_opMode == WLESS_SM_MODE_MANUAL)
    {
        if(WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE)
        {
            WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
            WLESS_SM_powerToLoad = 0;
            WLESS_SM_iCoilErr = 0;
            WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
            WLESS_SM_state = WLESS_SM_STATE_INIT_SOURCE;
        }
        else if(WLESS_SM_localRole == WLESS_SM_ROLE_LOAD)
        {
            WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
            WLESS_SM_powerToLoad = 0;
            WLESS_SM_iCoilErr = 0;
            WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
            WLESS_SM_state = WLESS_SM_STATE_INIT_LOAD;
        }
    }
}

static void WLESS_SM_runVehicleStep(void)
{
    int32_t energyDifference;

    switch(WLESS_SM_state)
    {
        case WLESS_SM_STATE_STANDBY:
            if(WLESS_SM_radioLinkKo())
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_DISCOVERY;
            }
            else if(WLESS_SM_opMode == WLESS_SM_MODE_MANUAL)
            {
                if(WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE)
                {
                    WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                    WLESS_SM_powerToLoad = 0;
                    WLESS_SM_iCoilErr = 0;
                    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                    WLESS_SM_state = WLESS_SM_STATE_INIT_SOURCE;
                }
                else if(WLESS_SM_localRole == WLESS_SM_ROLE_LOAD)
                {
                    WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                    WLESS_SM_powerToLoad = 0;
                    WLESS_SM_iCoilErr = 0;
                    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                    WLESS_SM_state = WLESS_SM_STATE_INIT_LOAD;
                }
            }
            break;

        case WLESS_SM_STATE_DISCOVERY:
            if(!WLESS_SM_radioLinkKo())
            {
                if(WLESS_SM_opMode == WLESS_SM_MODE_MANUAL)
                {
                    WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                    WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                    WLESS_SM_powerToLoad = 0;
                    WLESS_SM_iCoilErr = 0;
                    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                    WLESS_SM_state = WLESS_SM_STATE_STANDBY;
                }
                else
                {
                    energyDifference =
                        WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded) -
                        WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded);
                    WLESS_SM_powerToLoad = 0;
                    WLESS_SM_iCoilErr = 0;
                    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;

                    if(energyDifference >= WLESS_SM_ROLE_DEADBAND_WH)
                    {
                        WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
                        WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                        WLESS_SM_state = WLESS_SM_STATE_INIT_SOURCE;
                    }
                    else if(energyDifference <= -WLESS_SM_ROLE_DEADBAND_WH)
                    {
                        WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
                        WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                        WLESS_SM_state = WLESS_SM_STATE_INIT_LOAD;
                    }
                    else
                    {
                        WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                        WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                    }
                }
            }
            break;

        case WLESS_SM_STATE_INIT_SOURCE:
            if(WLESS_SM_initOkCommand != 0U)
            {
                WLESS_SM_initOkCommand = 0U;
                WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INITOK;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_WAIT_LOAD;
            }
            break;

        case WLESS_SM_STATE_INIT_LOAD:
            if(WLESS_SM_initOkCommand != 0U)
            {
                WLESS_SM_initOkCommand = 0U;
                WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INITOK;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_WAIT_SOURCE;
            }
            break;

