IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
        case WLESS_SM_STATE_LOAD_END:
            if(WLESS_SM_radioLinkKo())
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_DISCOVERY;
            }
            else if(WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_IDLE)
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_STANDBY;
            }
            break;

        case WLESS_SM_STATE_ENDCHARGE_SOURCE:
            if(WLESS_SM_confirmIBatLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_SOURCE_END;
            }
            break;

        case WLESS_SM_STATE_ENDCHARGE_LOAD:
            if(WLESS_SM_confirmICoilLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTEND;
                WLESS_SM_powerToLoad = 0;
                WLESS_SM_iCoilErr = 0;
                WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
                WLESS_SM_state = WLESS_SM_STATE_LOAD_END;
            }
            break;
#endif
    }
}
#else
static void WLESS_SM_runStationStep(void)
{
    switch(WLESS_SM_state)
    {
        case WLESS_SM_STATE_STANDBY:
            if((WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_INIT) &&
               (WLESS_SM_remoteRole == WLESS_SM_ROLE_LOAD))
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_INIT_SOURCE;
            }
            else if((WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_INIT) &&
                    (WLESS_SM_remoteRole == WLESS_SM_ROLE_SOURCE))
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_INIT_LOAD;
            }
            break;

        case WLESS_SM_STATE_INIT_SOURCE:
            if(WLESS_SM_initOkCommand != 0U)
            {
                WLESS_SM_initOkCommand = 0U;
                WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INITOK;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_WAIT_LOAD;
            }
            break;

        case WLESS_SM_STATE_INIT_LOAD:
            if(WLESS_SM_initOkCommand != 0U)
            {
                WLESS_SM_initOkCommand = 0U;
                WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_INITOK;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_WAIT_SOURCE;
            }
            break;

        case WLESS_SM_STATE_WAIT_LOAD:
            if(WLESS_SM_radioLinkKo())
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_STANDBY;
            }
            else if(WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_INITOK)
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_SOURCE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTON;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_SOURCE_PRECHARGE);
                WLESS_SM_state = WLESS_SM_STATE_PRECHARGE_SOURCE;
            }
            break;

        case WLESS_SM_STATE_WAIT_SOURCE:
            if(WLESS_SM_radioLinkKo())
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_STANDBY;
            }
            else if(WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_WPTON)
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_LOAD;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTON;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_LOAD_PRECHARGE);
                WLESS_SM_state = WLESS_SM_STATE_PRECHARGE_LOAD;
            }
            break;

        case WLESS_SM_STATE_PRECHARGE_SOURCE:
            if(WLESS_SM_radioLinkKo() ||
               (WLESS_SM_remoteAbort == WLESS_SM_ABORT_ENABLED))
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_OFF);
                WLESS_SM_state = WLESS_SM_STATE_ENDCHARGE_SOURCE;
            }
            else if(WLESS_SM_confirmVBusReady())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTON;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_SOURCE_ON);
                WLESS_SM_state = WLESS_SM_STATE_SOURCE_ON;
            }
            break;

        case WLESS_SM_STATE_PRECHARGE_LOAD:
            if(WLESS_SM_radioLinkKo() ||
               (WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_WPTOFF))
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_OFF);
                WLESS_SM_state = WLESS_SM_STATE_ENDCHARGE_LOAD;
            }
            else if(WLESS_SM_confirmVBusReady())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTON;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_LOAD_ON);
                WLESS_SM_state = WLESS_SM_STATE_LOAD_ON;
            }
            break;

