IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
        case WLESS_SM_STATE_SOURCE_ON:
            if(WLESS_SM_radioLinkKo() ||
               (WLESS_SM_remoteAbort == WLESS_SM_ABORT_ENABLED))
            {
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_OFF);
                WLESS_SM_state = WLESS_SM_STATE_DISCHARGE_SOURCE;
            }
            break;

        case WLESS_SM_STATE_LOAD_ON:
            if((WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_WPTOFF) ||
               WLESS_SM_radioLinkKo())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_setPowerCommand(WLESS_SM_POWER_CMD_OFF);
                WLESS_SM_state = WLESS_SM_STATE_DISCHARGE_LOAD;
            }
            break;

        case WLESS_SM_STATE_DISCHARGE_SOURCE:
            if(WLESS_SM_confirmIBatLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_SOURCE_OFF;
            }
            break;

        case WLESS_SM_STATE_DISCHARGE_LOAD:
            if(WLESS_SM_confirmICoilLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_LOAD_OFF;
            }
            break;

        case WLESS_SM_STATE_SOURCE_OFF:
            if(WLESS_SM_confirmICoilLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_SOURCE_END;
            }
            break;

        case WLESS_SM_STATE_LOAD_OFF:
            if(WLESS_SM_confirmIBatLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTEND;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_LOAD_END;
            }
            break;

        case WLESS_SM_STATE_SOURCE_END:
            if(WLESS_SM_radioLinkKo() ||
               (WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_WPTEND))
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_STANDBY;
            }
            break;

        case WLESS_SM_STATE_LOAD_END:
            if(WLESS_SM_radioLinkKo() ||
               (WLESS_SM_remoteCtrlState == WLESS_SM_CTRL_IDLE))
            {
                WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_STANDBY;
            }
            break;

        case WLESS_SM_STATE_ENDCHARGE_SOURCE:
            if(WLESS_SM_confirmIBatLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTOFF;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_SOURCE_END;
            }
            break;

        case WLESS_SM_STATE_ENDCHARGE_LOAD:
            if(WLESS_SM_confirmICoilLow())
            {
                WLESS_SM_localCtrlState = WLESS_SM_CTRL_WPTEND;
                WLESS_SM_resetLocalExchange();
                WLESS_SM_state = WLESS_SM_STATE_LOAD_END;
            }
            break;

        default:
            break;
    }
}
#endif

void WLESS_SM_run(void)
{
    WLESS_SM_State previousState;

    if(WLESS_SM_diagnosticMessagePending == 0U)
    {
        return;
    }

    WLESS_SM_diagnosticMessagePending = 0U;
    WLESS_SM_stateStepCounter++;

    if(WLESS_SM_filterState != WLESS_SM_state)
    {
        WLESS_SM_resetFilter(&WLESS_SM_vBusFilter);
        WLESS_SM_resetFilter(&WLESS_SM_iBatFilter);
        WLESS_SM_resetFilter(&WLESS_SM_iCoilFilter);
        WLESS_SM_filterState = WLESS_SM_state;
    }

    if(WLESS_SM_filterRole != WLESS_SM_localRole)
    {
        WLESS_SM_resetFilter(&WLESS_SM_sourceEmptyFilter);
        WLESS_SM_resetFilter(&WLESS_SM_loadFullFilter);
        WLESS_SM_resetFilter(&WLESS_SM_energyBalanceFilter);
        WLESS_SM_filterRole = WLESS_SM_localRole;
    }

    previousState = WLESS_SM_state;

#if WLESS_SM_TEST_RUN_DISPATCH_ONLY == 1
    // Diagnostic isolation: verify WLESS_SM_run() scheduling and bookkeeping
    // without entering either role-specific state-machine implementation.
#elif WLESS_SM_TEST_VEHICLE_STANDBY_ONLY == 1
    WLESS_SM_runVehicleStandbyOnly();
#elif WLESS_SM_BUILD_VEHICLE == 1
    WLESS_SM_runVehicleStep();
#else
    WLESS_SM_runStationStep();
#endif

    if(WLESS_SM_state != previousState)
    {
        WLESS_SM_statusUpdatePending = 1U;
    }
}
